namespace Task3;
class Program
    {

    /*Ввести з консолі рядок у вигляді речення. Розбити його на окремі
        слова. Визначити кількість слів. Вивести на консоль кожне слово і
        його довжину.*/

    static void Main(string[] args)
        {
        Console.WriteLine("Введіть речення: ");
        string speech = Console.ReadLine();
        string[] str = speech.Split(new Char[] { ' ', ',', '.' }); //Перетворюємо введену строку в массив слів орієнтуючись по пробілу, комі та крапці
        int count = 0; //лічильник слів
        foreach (string s in str) //проходимо циклом по всьому рядку
            {
            if (s.Trim() != "") //якщо слово більше 1 символу, то рахуємо його
                {
                Console.WriteLine($"{s}, довжина слова {s.Length}"); //Виводимо в консоль слово та кількість знаків у ньому (довжину)
                count++; //змільшуємо лічильник слів
                }
            }
        Console.WriteLine($"Кількість слів у реченні - {count}"); //Виводимо кількість слів у рядку
        }
    }

